# Joins

In [5]:
# Hier ist nur Code zum Initialisieren der Umgebeung, bitte gehen Sie weiter, es gibt nichts zu sehen.

# Keine langen Fehlermeldungen
import sys
ipython = get_ipython()

def exception_handler(exception_type, exception, traceback):
    print("%s: %s" % (exception_type.__name__, exception), file=sys.stderr)

ipython._showtraceback = exception_handler

# Lade die Erweiterung, damit wir SQL Befehle nutzen können
%reload_ext sql
# Verbinde Dich zu einer in - Memory Datenbank
%sql sqlite:///
%sql PRAGMA foreign_keys = ON

 * sqlite:///
Done.

[]

# Die verschiedenen Joins

Es gibt verschiedene Arten Joins zu erklären. Ich bevorzuge immer noch folgendes Bild:

![](https://nextcloud.th-deg.de/s/Kc7m486Z3KbZyB4/download?path=%2F&files=SQL_Joins.png)

In [6]:
%%sql

DROP TABLE IF EXISTS eins;
DROP TABLE IF EXISTS zwei;

CREATE TABLE eins(id INT PRIMARY KEY, val CHAR(1));
INSERT INTO eins VALUES(1,'A'), (2,'B'), (3,'C');
CREATE TABLE zwei(id INT PRIMARY KEY, val2 CHAR(1));
INSERT INTO zwei VALUES(2,'D'), (3,'E'), (4,'F');

 * sqlite:///
Done.
Done.
Done.
3 rows affected.
Done.
3 rows affected.

[]

In [7]:
%%sql

SELECT * FROM eins;

 * sqlite:///
Done.

[(1, 'A'), (2, 'B'), (3, 'C')]

In [8]:
%%sql

SELECT * FROM zwei;

 * sqlite:///
Done.

[(2, 'D'), (3, 'E'), (4, 'F')]

# Aufgabe 1
Führen sie an den Tabellen `eins, zwei` verschiedene `JOINS` durch, um ein Gefühl für die veränderte Ergebnissmenge zu erhalten. Nachdem beide Tabellen gleich benannte `id` Attribute haben können Sie bei einem `JOIN` auf diese einen `NATURAL JOIN` oder `JOIN using(id)` oder `JOIN ON(eins.id = zwei.id)` verwenden.

#### Aufgabe 1.1 Implementieren Sie einen `INNER` Join in den drei oben genannten Varianten ✅

In [9]:
%%sql

-- Using `INNER JOIN`

SELECT eins.id, eins.val, zwei.val2
FROM eins
INNER JOIN zwei
ON eins.id = zwei.id

 * sqlite:///
Done.

[(2, 'B', 'D'), (3, 'C', 'E')]

In [10]:
%%sql

-- Using `NATURAL JOIN`

SELECT *
FROM eins
NATURAL JOIN zwei

 * sqlite:///
Done.

[(2, 'B', 'D'), (3, 'C', 'E')]

In [11]:
%%sql

-- Using `USING()

SELECT *
FROM eins
JOIN zwei USING(id);

 * sqlite:///
Done.

[(2, 'B', 'D'), (3, 'C', 'E')]

In [12]:
%%sql

-- Using `JOIN ON()

SELECT *
FROM eins
JOIN zwei ON(eins.id = zwei.id)

 * sqlite:///
Done.

[(2, 'B', 2, 'D'), (3, 'C', 3, 'E')]

#### Aufgabe 1.2 Implementieren Sie einen `LEFT Join` ✅

In [13]:
%%sql

SELECT *
FROM eins
LEFT JOIN zwei
USING(id)

 * sqlite:///
Done.

[(1, 'A', None), (2, 'B', 'D'), (3, 'C', 'E')]

In [14]:
%%sql

SELECT *
FROM eins
LEFT JOIN zwei
WHERE eins.id = zwei.id

-- The result set includes only the rows where `eins.id` matches `zwei.id`, effectively converting the `LEFT JOIN` into an `INNER JOIN`.
-- Both `id` and `id_1` columns appear in the result set because they come from both sides.

 * sqlite:///
Done.

[(2, 'B', 2, 'D'), (3, 'C', 3, 'E')]

#### Aufgabe 1.3 Implementieren Sie einen `RIGHT Join` ✅

In [15]:
%%sql

SELECT *
FROM eins
RIGHT JOIN zwei
USING(id)

-- Hmmm, this didn't work previously.

 * sqlite:///
Done.

[(2, 'B', 'D'), (3, 'C', 'E'), (4, None, 'F')]

In [16]:
%%sql

SELECT *
FROM zwei
LEFT JOIN eins
USING(id)

 * sqlite:///
Done.

[(2, 'D', 'B'), (3, 'E', 'C'), (4, 'F', None)]

#### Aufgabe 1.4 Implementieren Sie `A - B` ✅

In [17]:
%%sql

SELECT *
FROM eins e
LEFT JOIN zwei z
USING(id)
WHERE z.val2 IS NULL

 * sqlite:///
Done.

[(1, 'A', None)]

#### Aufgabe 1.5 Implementieren Sie `B - A` ✅

In [18]:
%%sql

SELECT *
FROM zwei z 
LEFT JOIN eins e 
USING(id)
WHERE e.val IS NULL

 * sqlite:///
Done.

[(4, 'F', None)]

#### Aufgabe 1.5 Implementieren Sie einen `FULL OUTER JOIN` ✅

In [20]:
%%sql

SELECT DISTINCT *
FROM eins
FULL OUTER JOIN zwei
USING(id)

 * sqlite:///
Done.

[(1, 'A', None), (2, 'B', 'D'), (3, 'C', 'E'), (4, None, 'F')]

In [25]:
%%sql

SELECT DISTINCT *
FROM (
    SELECT id, val, val2
    FROM eins
    LEFT JOIN zwei
    USING(id)
    UNION ALL
    SELECT id, val, val2
    FROM zwei
    LEFT JOIN eins
    USING(id)
) AS gemeinsam
ORDER BY id;

 * sqlite:///
Done.

[(1, 'A', None), (2, 'B', 'D'), (3, 'C', 'E'), (4, None, 'F')]

# Aufgabe 2

Die Beispiele aus Aufgabe 1 waren bewusst abstrakt gewählt. Was heißt die jeweilige Form von Joins denn auf einen konkreten Use-Case? Was würde jede einzelne Join form bedeuten, wenn es um Stundenten und Bücher ginge, die Studenten ausleihen können?

- Inner Join: 
- Left Outer Join:
- Right Outer Join:
- Student - Buch:
- Buch - Student:
- FULL OUTER JOIN:

<details>
  <summary><b><u>Answer</u></b></summary>

- Inner Join: Students who borrowed a book and the book is known.
- Left Outer Join: Students who borrowed or did not borrow a book, and the book is known.
- Right Outer Join: Students who borrowed a book, including all the books in the database (library).
- Student - Buch: Students who did not borrow a book.
- Buch - Student: Books that are not borrowed.
- FULL OUTER JOIN: Includes everything, all students and all books, students who borrowed or did not borrow, books that are borrowed and not borrowed.

</details>

# Aufgabe 3

Betrachten wir folgene Modellierung:

![](https://nextcloud.th-deg.de/s/Kc7m486Z3KbZyB4/download?path=%2F&files=bib.png)

In [ ]:
%%sql

DROP TABLE IF EXISTS leiht_aus;
DROP TABLE IF EXISTS ist_ueberfaellig;
DROP TABLE IF EXISTS student;
DROP TABLE IF EXISTS buch;

CREATE TABLE student(
    matrikelnummer INT PRIMARY KEY NOT NULL,
    name TEXT NOT NULL
);

CREATE TABLE buch(
    isbn TEXT PRIMARY KEY NOT NULL,
    name TEXT NOT NULL
);

CREATE TABLE leiht_aus(
    matrikelnummer INT NOT NULL,
    isbn TEXT NOT NULL,
    von DATE NOT NULL,
    bis DATE,
    PRIMARY KEY(matrikelnummer, isbn, von),
    FOREIGN KEY(matrikelnummer) REFERENCES student(matrikelnummer),
    FOREIGN KEY(isbn) REFERENCES buch(isbn)
);

CREATE TABLE ist_ueberfaellig(
    matrikelnummer INT NOT NULL,
    isbn TEXT NOT NULL,
    gebuer INT,
    PRIMARY KEY(matrikelnummer, isbn),
    FOREIGN KEY(matrikelnummer) REFERENCES student(matrikelnummer),
    FOREIGN KEY(isbn) REFERENCES buch(isbn)
);

In [ ]:
%%sql
INSERT INTO student VALUES(1,'Elser'), (2, 'Maier'), (3, 'Huber');
INSERT INTO buch VALUES(1,'Datenbanken'), (2, 'Ulysses'), (3, 'Das Niebelungenlied');
INSERT INTO ist_ueberfaellig VALUES(1,2,10), (2,2,15), (2,3,22);
INSERT INTO leiht_aus VALUES(1,1,'01.10.2021',NULL), (1,2,'01.11.2021',NULL), (2,3,'01.11.2021','11.11.2021');

#### Aufgabe 3.1

Entwickeln Sie einen JOIN, der angibt welche Studenten welche Bücher ausgeliehen haben und welche Gebüren da noch zu zahlen sind.

#### Aufgabe 3.2

Geben Sie nur ausleihen aus, die > 20 Euro Gebüren haben